# 1. Напишите функцию, которая будет принимать номер кредитной карты и
# показывать только последние 4 цифры. Остальные цифры должны заменяться
# звездочками


# def Number_card(a):
#     return '*' * len(a[:-4]) + a[-4:]
#
# print(Number_card(input('Введите номер карты:')))


# 2. Напишите функцию, которая проверяет: является ли слово палиндромом
# def isPol(b):
#     revs = ''.join(reversed(b))
#     if (b == revs):
#         return True
#     return False
#
#
# b = "lol"
# print(isPol(b))


